//注册一个小程序
App({
  //*******************1.全局数据共享*******************
    globalData: {
      name: '王言伟',
      age: 23,
      sex: '男'
    },

  //********************生命周期函数********************
  //当小程序初始化完成时触发（全局只触发一次）
  onLaunch(options) {
    //2.获取用户信息
    //3.发送网络请求
    //4.判断小程序的进入场景
    switch(options.scene){
      case(1001):
        break;
      case(1005):
        break;
    }
    
  },

  //当小程序启动或从后台进入前台显示触发 (触发多次)
  onShow(options) {
    
  },

  //当小程序从前台进入后台触发
  onHide() {
    
  },

  //当小程序发生脚本错误或者api调用失败时触发,并带上错误信息;
  onError(msg) {
    
  },
})
